morfredus/ESP32-Diagnostic/src/main.cpp
  builtinLedTestResult = String(Texts::gpio) + " " + String(BUILTIN_LED_PIN) + " - " + String(Texts::not_tested);
  Serial.printf("LED integree: GPIO %d\r\n", BUILTIN_LED_PIN);
}

void testBuiltinLED() {
  if (BUILTIN_LED_PIN == -1) return;
  
  Serial.println("\r\n=== TEST LED ===");
  pinMode(BUILTIN_LED_PIN, OUTPUT);

  for (int i = 0; i < 5; i++) {
    digitalWrite(BUILTIN_LED_PIN, HIGH);
    delay(80);
    digitalWrite(BUILTIN_LED_PIN, LOW);
    delay(80);
  }

  for (int i = 0; i <= 255; i += 51) {
    analogWrite(BUILTIN_LED_PIN, i);
    delay(25);
    yield();
  }
  for (int i = 255; i >= 0; i -= 51) {
    analogWrite(BUILTIN_LED_PIN, i);
    delay(25);
    yield();
  }
  
  digitalWrite(BUILTIN_LED_PIN, LOW);
  builtinLedAvailable = true;
  builtinLedTestResult = String(Texts::test) + " " + String(Texts::ok) + " - GPIO " + String(BUILTIN_LED_PIN);
  builtinLedTested = true;
  Serial.println("LED: OK");
}

void resetBuiltinLEDTest() {
  builtinLedTested = false;
  builtinLedAvailable = false;
  if (BUILTIN_LED_PIN != -1) digitalWrite(BUILTIN_LED_PIN, LOW);
}

// ========== NEOPIXEL ==========
void detectNeoPixelSupport() {
  String chipModel = detectChipModel();
  
  if (CUSTOM_LED_PIN != -1) {
    LED_PIN = CUSTOM_LED_PIN;
    neopixelSupported = true;
  }
  else if (chipModel == "ESP32-S3") {
    LED_PIN = 48;
    neopixelSupported = true;
  } 
  else if (chipModel == "ESP32-C3") {
    LED_PIN = 8;
    neopixelSupported = true;
  }
  else {
    LED_PIN = 2;
    neopixelSupported = false;
  }
  
  if (strip != nullptr) delete strip;
  strip = new Adafruit_NeoPixel(LED_COUNT, LED_PIN, NEO_GRB + NEO_KHZ800);
  neopixelTestResult = String(Texts::gpio) + " " + String(LED_PIN) + " - " + String(Texts::not_tested);
  Serial.printf("NeoPixel: GPIO %d\r\n", LED_PIN);
}

void testNeoPixel() {
  if (!strip) return;

  Serial.println("\r\n=== TEST NEOPIXEL ===");
  strip->begin();
  strip->clear();
  strip->show();

  strip->setPixelColor(0, strip->Color(255, 0, 0));
  strip->show();
  delay(160);

  strip->setPixelColor(0, strip->Color(0, 255, 0));
  strip->show();
  delay(160);

  strip->setPixelColor(0, strip->Color(0, 0, 255));
  strip->show();
  delay(160);

  for (int i = 0; i < 256; i += 64) {
    strip->setPixelColor(0, strip->gamma32(strip->ColorHSV(i * 256)));
    strip->show();
    delay(28);
    yield();
  }

  strip->clear();
  strip->show();

  neopixelAvailable = true;
  neopixelTestResult = String(Texts::test) + " " + String(Texts::ok) + " - GPIO " + String(LED_PIN);
  neopixelTested = true;
  Serial.println("NeoPixel: OK");
}

void resetNeoPixelTest() {
  neopixelTested = false;
  neopixelAvailable = false;
  if (strip) {
    strip->clear();
    strip->show();
  }
}

void neopixelRainbow() {
  if (!strip) return;
  for (int i = 0; i < 256; i++) {
    for (int j = 0; j < LED_COUNT; j++) {
      strip->setPixelColor(j, strip->gamma32(strip->ColorHSV(i * 256)));
    }
    strip->show();
    delay(10);
  }
}

void neopixelBlink(uint32_t color, int times) {
  if (!strip) return;
  for (int i = 0; i < times; i++) {
    strip->fill(color);
    strip->show();
    delay(120);
    strip->clear();
    strip->show();
    delay(120);
  }
}

void neopixelFade(uint32_t color) {
  if (!strip) return;
  for (int brightness = 0; brightness <= 255; brightness += 5) {
    strip->setBrightness(brightness);
    strip->fill(color);
    strip->show();
    delay(20);
  }
  for (int brightness = 255; brightness >= 0; brightness -= 5) {
    strip->setBrightness(brightness);
    strip->fill(color);
    strip->show();
    delay(20);
  }
  strip->setBrightness(255);
}

void neopixelChase() {
  if (!strip) return;
  uint32_t colors[] = {
    strip->Color(255, 0, 0),
    strip->Color(0, 255, 0),
    strip->Color(0, 0, 255),
    strip->Color(255, 255, 0),
    strip->Color(255, 0, 255),
    strip->Color(0, 255, 255)
  };
  int numColors = sizeof(colors) / sizeof(colors[0]);

  for (int cycle = 0; cycle < 3; cycle++) {
    for (int colorIndex = 0; colorIndex < numColors; colorIndex++) {
      for (int pos = 0; pos < LED_COUNT; pos++) {
        strip->clear();
        for (int i = 0; i < LED_COUNT; i++) {
          if ((i + pos) % 3 == 0) {
            strip->setPixelColor(i, colors[colorIndex]);
          }
        }
        strip->show();
        delay(100);
      }
    }
  }
  strip->clear();
  strip->show();
}

void applyOLEDOrientation() {
  const u8g2_cb_t *rotation = U8G2_R0;
  switch(oledRotation & 0x03) {
    case 0: rotation = U8G2_R0; break;
    case 1: rotation = U8G2_R1; break;
    case 2: rotation = U8G2_R2; break;
    case 3: rotation = U8G2_R3; break;
  }
  oled.setDisplayRotation(rotation);
}

void detectOLED() {
  Serial.println("\r\n=== DETECTION OLED ===");
  ensureI2CBusConfigured();
  Serial.printf("I2C: SDA=%d, SCL=%d\r\n", I2C_SDA, I2C_SCL);

  Wire.beginTransmission(SCREEN_ADDRESS);
  bool i2cDetected = (Wire.endTransmission() == 0);

  if(i2cDetected && oled.begin()) {
    oledAvailable = true;
    applyOLEDOrientation();
    oledTestResult = String(Texts::detected) + " @ 0x" + String(SCREEN_ADDRESS, HEX);
    Serial.println("OLED: Detecte!\r\n");
  } else {
    oledAvailable = false;
    if (i2cDetected) {
      oledTestResult = String(Texts::i2c_peripherals) + " - " + String(Texts::fail);
    } else {
      oledTestResult = String(Texts::not_detected) + " (SDA:" + String(I2C_SDA) + " SCL:" + String(I2C_SCL) + ")";
    }
    Serial.println("OLED: Non detecte\r\n");
  }
}

void oledStepWelcome() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 10, "TEST OLED 0.96\"");
  oled.drawStr(0, 30, "128x64 pixels");
  char buf[32];
  snprintf(buf, sizeof(buf), "I2C: 0x%02X", SCREEN_ADDRESS);
  oled.drawStr(0, 45, buf);
  snprintf(buf, sizeof(buf), "SDA:%d SCL:%d", I2C_SDA, I2C_SCL);
  oled.drawStr(0, 60, buf);
  oled.sendBuffer();
  delay(700);
}

void oledStepBigText() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_ncenB14_tr);
  oled.drawStr(20, 35, "ESP32");
  oled.sendBuffer();
  delay(450);
}

void oledStepTextSizes() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 10, "Taille 1");
  oled.setFont(u8g2_font_ncenB14_tr);
  oled.drawStr(0, 30, "Taille 2");
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 50, "Retour taille 1");
  oled.sendBuffer();
  delay(550);
}

void oledStepShapes() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.drawFrame(10, 10, 30, 20);
  oled.drawBox(50, 10, 30, 20);
  oled.drawCircle(25, 50, 10);
  oled.drawDisc(65, 50, 10);
  oled.drawTriangle(95, 30, 85, 10, 105, 10);
  oled.sendBuffer();
  delay(550);
}

