morfredus/ESP32-Diagnostic/src/main.cpp
  uint16_t colors[] = {TFT_RED, TFT_GREEN, TFT_BLUE, TFT_YELLOW, TFT_CYAN, TFT_MAGENTA, TFT_WHITE};
  const char* names[] = {"RED", "GREEN", "BLUE", "YELLOW", "CYAN", "MAGENTA", "WHITE"};
  
  for (int i = 0; i < 7; i++) {
    tft.fillScreen(colors[i]);
    tft.setTextColor(TFT_BLACK);
    tft.setTextSize(2);
    tft.setCursor(60, 110);
    tft.print(names[i]);
    delay(500);
  }
#endif
}

void tftStepShapes() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  // Rectangles
  tft.drawRect(20, 20, 80, 60, TFT_RED);
  tft.fillRect(140, 20, 80, 60, TFT_GREEN);
  
  // Circles
  tft.drawCircle(60, 140, 30, TFT_BLUE);
  tft.fillCircle(180, 140, 30, TFT_YELLOW);
  
  // Triangles
  tft.drawTriangle(60, 180, 40, 220, 80, 220, TFT_CYAN);
  tft.fillTriangle(180, 180, 160, 220, 200, 220, TFT_MAGENTA);
  
  delay(1500);
#endif
}

void tftStepText() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(1);
  tft.setCursor(10, 10);
  tft.println("Text Size 1");
  
  tft.setTextSize(2);
  tft.setCursor(10, 40);
  tft.println("Size 2");
  
  tft.setTextSize(3);
  tft.setCursor(10, 80);
  tft.println("Size 3");
  
  tft.setTextColor(TFT_CYAN);
  tft.setTextSize(2);
  tft.setCursor(10, 140);
  tft.println("Colored Text");
  
  delay(1500);
#endif
}

void tftStepLines() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  // Horizontal lines
  for (int y = 0; y < TFT_HEIGHT; y += 10) {
    tft.drawFastHLine(0, y, TFT_WIDTH, TFT_CYAN);
  }
  delay(700);
  
  tft.fillScreen(TFT_BLACK);
  
  // Vertical lines
  for (int x = 0; x < TFT_WIDTH; x += 10) {
    tft.drawFastVLine(x, 0, TFT_HEIGHT, TFT_MAGENTA);
  }
  delay(700);
  
  tft.fillScreen(TFT_BLACK);
  
  // Diagonal lines
  for (int i = 0; i < TFT_WIDTH; i += 20) {
    tft.drawLine(0, 0, i, TFT_HEIGHT - 1, TFT_YELLOW);
    tft.drawLine(TFT_WIDTH - 1, 0, i, TFT_HEIGHT - 1, TFT_GREEN);
  }
  delay(700);
#endif
}

void tftStepAnimation() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  // Moving square
  int squareSize = 30;
  for (int x = 0; x <= TFT_WIDTH - squareSize; x += 5) {
    tft.fillRect(x, (TFT_HEIGHT - squareSize) / 2, squareSize, squareSize, TFT_BLUE);
    delay(20);
    if (x + squareSize < TFT_WIDTH) {
      tft.fillRect(x, (TFT_HEIGHT - squareSize) / 2, squareSize, squareSize, TFT_BLACK);
    }
    yield();
  }
  
  delay(500);
#endif
}

void tftStepProgressBar() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(60, 40);
  tft.print("Loading...");
  
  int barX = 30;
  int barY = 100;
  int barWidth = 180;
  int barHeight = 30;
  
  tft.drawRect(barX, barY, barWidth, barHeight, TFT_WHITE);
  
  for (int i = 0; i <= 100; i += 5) {
    int fillWidth = (barWidth - 4) * i / 100;
    tft.fillRect(barX + 2, barY + 2, fillWidth, barHeight - 4, TFT_GREEN);
    
    tft.fillRect(40, 150, 160, 20, TFT_BLACK);
    tft.setTextColor(TFT_CYAN);
    tft.setTextSize(2);
    tft.setCursor(90, 155);
    tft.print(i);
    tft.print("%");
    
    delay(30);
    yield();
  }
  
  delay(500);
#endif
}

void tftStepFinal() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  tft.setTextColor(TFT_GREEN);
  tft.setTextSize(3);
  tft.setCursor(40, 80);
  tft.println("TEST");
  tft.setCursor(20, 120);
  tft.println("COMPLETE!");
  
  // Success indicator
  tft.fillCircle(120, 180, 20, TFT_GREEN);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(3);
  tft.setCursor(108, 172);
  tft.print("OK");
  
  delay(2000);
#endif
}

bool performTFTStep(const String &stepId) {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    return false;
  }

  if (stepId == "boot") {
    tftStepBoot();
  } else if (stepId == "colors") {
    tftStepColors();
  } else if (stepId == "shapes") {
    tftStepShapes();
  } else if (stepId == "text") {
    tftStepText();
  } else if (stepId == "lines") {
    tftStepLines();
  } else if (stepId == "animation") {
    tftStepAnimation();
  } else if (stepId == "progress") {
    tftStepProgressBar();
  } else if (stepId == "final") {
    tftStepFinal();
  } else {
    return false;
  }

  return true;
#else
  return false;
#endif
}

String getTFTStepLabel(const String &stepId) {
  if (stepId == "boot") return "Boot Screen";
  if (stepId == "colors") return "Colors";
  if (stepId == "shapes") return "Shapes";
  if (stepId == "text") return "Text";
  if (stepId == "lines") return "Lines";
  if (stepId == "animation") return "Animation";
  if (stepId == "progress") return "Progress Bar";
  if (stepId == "final") return "Final Message";
  return stepId;
}

void testTFT() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    tftTestResult = String(Texts::not_available);
    return;
  }

  Serial.println("\r\n=== TEST TFT ===");

  tftStepBoot();
  tftStepColors();
  tftStepShapes();
  tftStepText();
  tftStepLines();
  tftStepAnimation();
  tftStepProgressBar();
  tftStepFinal();

  tftTestResult = "OK - Tests complets";
  Serial.println("TFT: Tests complets OK\r\n");
#endif
}

// ========== TEST ADC ==========
void testADC() {
  Serial.println("\r\n=== TEST ADC ===");
  adcReadings.clear();
  
  #ifdef CONFIG_IDF_TARGET_ESP32
    int adcPins[] = {36, 39, 34, 35, 32, 33};
    int numADC = 6;
  #elif defined(CONFIG_IDF_TARGET_ESP32S3)
    int adcPins[] = {1, 2, 3, 4, 5, 6};
    int numADC = 6;
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    int adcPins[] = {0, 1, 2, 3, 4};
    int numADC = 5;
  #else
    int adcPins[] = {36, 39};
    int numADC = 2;
  #endif

  for (int i = 0; i < numADC; i++) {
    ADCReading reading;
    reading.pin = adcPins[i];
    reading.rawValue = analogRead(adcPins[i]);
    reading.voltage = (reading.rawValue / 4095.0) * 3.3;
    adcReadings.push_back(reading);

    Serial.printf("GPIO%d: %d (%.2fV)\r\n", reading.pin, reading.rawValue, reading.voltage);
  }
  
  adcTestResult = String(numADC) + " " + String(Texts::channels) + " - " + String(Texts::ok);
  Serial.printf("ADC: %d canaux testes\r\n", numADC);
}

// ========== TEST PWM ==========
void testPWM() {
  Serial.println("\r\n=== TEST PWM ===");
  int testPin = 2;

  #ifdef CONFIG_IDF_TARGET_ESP32S3
    testPin = 48;
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    testPin = 8;
  #endif

  Serial.printf("Test PWM sur GPIO%d\r\n", testPin);

  // --- [PLATFORMIO FIX] Use legacy LEDC API for PlatformIO compatibility ---
  uint8_t pwmChannel = 0;
  ledcSetup(pwmChannel, 5000, 8);       // channel, freq, resolution
  ledcAttachPin(testPin, pwmChannel);    // pin, channel

  for (int duty = 0; duty <= 255; duty += 51) {
    ledcWrite(pwmChannel, duty);         // channel, duty
    Serial.printf("PWM duty: %d/255\r\n", duty);
    delay(80);
    yield();
  }

  ledcWrite(pwmChannel, 0);
  ledcDetachPin(testPin);                // pin

  pwmTestResult = String(Texts::test) + " " + String(Texts::ok) + " - GPIO " + String(testPin);
  Serial.println("PWM: OK");
}

// ========== SCAN SPI ==========
void scanSPI() {
  Serial.println("\r\n=== SCAN SPI ===");
  spiInfo = "";
  
