morfredus/ESP32-Diagnostic/src/main.cpp
  #ifdef CONFIG_IDF_TARGET_ESP32
    spiInfo = "HSPI (12,13,14,15), VSPI (18,19,23,5)";
    Serial.println("SPI: HSPI + VSPI disponibles");
  #elif defined(CONFIG_IDF_TARGET_ESP32S2)
    spiInfo = "SPI2, SPI3 disponibles";
    Serial.println("SPI: SPI2, SPI3");
  #elif defined(CONFIG_IDF_TARGET_ESP32S3)
    spiInfo = "SPI2, SPI3 disponibles";
    Serial.println("SPI: SPI2, SPI3");
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    spiInfo = "SPI2 disponible";
    Serial.println("SPI: SPI2");
  #else
    spiInfo = "Info SPI non disponible";
  #endif
}

// ========== LISTING PARTITIONS ==========
void listPartitions() {
  Serial.println("\r\n=== PARTITIONS FLASH ===");
  partitionsInfo = "";
  
  esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
  
  int count = 0;
  while (it != NULL) {
    const esp_partition_t *part = esp_partition_get(it);
    
    char line[128];
    sprintf(line, "%s - Type:0x%02x Addr:0x%08x Size:%dKB", 
            part->label, part->type, part->address, part->size / 1024);
    
    if (count > 0) partitionsInfo += "\r\n";
    partitionsInfo += String(line);
    
    Serial.println(line);
    
    it = esp_partition_next(it);
    count++;
  }
  
  esp_partition_iterator_release(it);
  Serial.printf("Total: %d partitions\r\n", count);
}

// TEST LED RGB
void testRGBLed() {
  Serial.println("\r\n=== TEST LED RGB ===");

  if (RGB_LED_PIN_R < 0 || RGB_LED_PIN_G < 0 || RGB_LED_PIN_B < 0) {
    rgbLedTestResult = String(Texts::configuration_invalid);
    rgbLedAvailable = false;
    Serial.println("LED RGB: Configuration invalide");
    return;
  }

  pinMode(RGB_LED_PIN_R, OUTPUT);
  pinMode(RGB_LED_PIN_G, OUTPUT);
  pinMode(RGB_LED_PIN_B, OUTPUT);

  Serial.printf("Test LED RGB - R:%d G:%d B:%d\r\n", RGB_LED_PIN_R, RGB_LED_PIN_G, RGB_LED_PIN_B);

  digitalWrite(RGB_LED_PIN_R, LOW);
  digitalWrite(RGB_LED_PIN_G, LOW);
  digitalWrite(RGB_LED_PIN_B, LOW);
  delay(120);

  digitalWrite(RGB_LED_PIN_R, HIGH);
  delay(150);
  digitalWrite(RGB_LED_PIN_R, LOW);

  digitalWrite(RGB_LED_PIN_G, HIGH);
  delay(150);
  digitalWrite(RGB_LED_PIN_G, LOW);

  digitalWrite(RGB_LED_PIN_B, HIGH);
  delay(150);
  digitalWrite(RGB_LED_PIN_B, LOW);

  rgbLedTestResult = String(Texts::ok);
  rgbLedAvailable = true;
  Serial.println("LED RGB: OK");
}

void setRGBLedColor(int r, int g, int b) {
  if (RGB_LED_PIN_R >= 0 && RGB_LED_PIN_G >= 0 && RGB_LED_PIN_B >= 0) {
    analogWrite(RGB_LED_PIN_R, r);
    analogWrite(RGB_LED_PIN_G, g);
    analogWrite(RGB_LED_PIN_B, b);
  }
}

// TEST BUZZER
void testBuzzer() {
  Serial.println("\r\n=== TEST BUZZER ===");

  if (BUZZER_PIN < 0) {
    buzzerTestResult = String(Texts::configuration_invalid);
    buzzerAvailable = false;
    Serial.println("Buzzer: Configuration invalide");
    return;
  }

  pinMode(BUZZER_PIN, OUTPUT);
  Serial.printf("Test Buzzer - Pin:%d\r\n", BUZZER_PIN);

  tone(BUZZER_PIN, 1000, 160);
  delay(220);
  tone(BUZZER_PIN, 1500, 160);
  delay(220);
  tone(BUZZER_PIN, 2000, 160);
  delay(220);
  noTone(BUZZER_PIN);

  buzzerTestResult = String(Texts::ok);
  buzzerAvailable = true;
  Serial.println("Buzzer: OK");
}

void playBuzzerTone(int frequency, int duration) {
  if (BUZZER_PIN >= 0) {
    tone(BUZZER_PIN, frequency, duration);
  }
}

// DHT sensor helpers
static inline const char* getDhtSensorName() {
  return (DHT_SENSOR_TYPE == 22) ? "DHT22" : "DHT11";
}

// TEST DHT SENSOR
void testDHTSensor() {
  const char* sensorName = getDhtSensorName();
  Serial.printf("\r\n=== TEST %s ===\r\n", sensorName);

  if (DHT_PIN < 0) {
    dhtTestResult = String(Texts::configuration_invalid);
    dhtAvailable = false;
    Serial.printf("%s: Configuration invalide\r\n", sensorName);
    return;
  }

  Serial.printf("Lecture %s - Pin:%d\r\n", sensorName, DHT_PIN);

  pinMode(DHT_PIN, OUTPUT);
  digitalWrite(DHT_PIN, LOW);
  delay(20);
  digitalWrite(DHT_PIN, HIGH);
  delayMicroseconds(40);
  pinMode(DHT_PIN, INPUT_PULLUP);

  uint8_t data[5] = {0};
  uint8_t bits[40] = {0};

  unsigned long timeout = millis();
  while (digitalRead(DHT_PIN) == HIGH) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  timeout = millis();
  while (digitalRead(DHT_PIN) == LOW) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  timeout = millis();
  while (digitalRead(DHT_PIN) == HIGH) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  for (int i = 0; i < 40; i++) {
    timeout = micros();
    while (digitalRead(DHT_PIN) == LOW) {
      if (micros() - timeout > 100) break;
    }

    unsigned long t = micros();
    timeout = micros();
    while (digitalRead(DHT_PIN) == HIGH) {
      if (micros() - timeout > 100) break;
    }

    if ((micros() - t) > 40) {
      bits[i] = 1;
    }
  }

  for (int i = 0; i < 5; i++) {
    data[i] = 0;
    for (int j = 0; j < 8; j++) {
      data[i] <<= 1;
      data[i] |= bits[i * 8 + j];
    }
  }

  if (data[4] == ((data[0] + data[1] + data[2] + data[3]) & 0xFF)) {
    if (DHT_SENSOR_TYPE == 22) {
      uint16_t rawHumidity = (static_cast<uint16_t>(data[0]) << 8) | data[1];
      uint16_t rawTemperature = (static_cast<uint16_t>(data[2]) << 8) | data[3];
      bool negative = rawTemperature & 0x8000;
      if (negative) {
        rawTemperature &= 0x7FFF;
      }
      dhtHumidity = rawHumidity * 0.1f;
      dhtTemperature = rawTemperature * 0.1f;
      if (negative) {
        dhtTemperature = -dhtTemperature;
      }
    } else {
      dhtHumidity = static_cast<float>(data[0]) + static_cast<float>(data[1]) * 0.1f;
      dhtTemperature = static_cast<float>(data[2]) + static_cast<float>(data[3]) * 0.1f;
    }
    dhtTestResult = String(Texts::ok);
    dhtAvailable = true;
    Serial.printf("%s: T=%.1f°C H=%.1f%%\r\n", sensorName, dhtTemperature, dhtHumidity);
  } else {
    dhtTestResult = String(Texts::error_label);
    dhtAvailable = false;
    Serial.printf("%s: Checksum error\r\n", sensorName);
  }
}

// TEST LIGHT SENSOR
void testLightSensor() {
  Serial.println("\r\n=== TEST LIGHT SENSOR ===");

  if (LIGHT_SENSOR_PIN < 0) {
    lightSensorTestResult = String(Texts::configuration_invalid);
    lightSensorAvailable = false;
    Serial.println("Light Sensor: Configuration invalide");
    return;
  }

  pinMode(LIGHT_SENSOR_PIN, INPUT);
  Serial.printf("Lecture Light Sensor - Pin:%d\r\n", LIGHT_SENSOR_PIN);

  int sum = 0;
  const int samples = 6;
  for (int i = 0; i < samples; i++) {
    sum += analogRead(LIGHT_SENSOR_PIN);
    delay(8);
    yield();
  }
  lightSensorValue = sum / samples;

  lightSensorTestResult = String(Texts::ok);
  lightSensorAvailable = true;
  Serial.printf("Light Sensor: %d\r\n", lightSensorValue);
}

// TEST DISTANCE SENSOR
void testDistanceSensor() {
  Serial.println("\r\n=== TEST DISTANCE SENSOR (HC-SR04) ===");

