morfredus/ESP32-Diagnostic/src/main.cpp
  String stepId = server.arg("step");

  if (!tftAvailable) {
    sendActionResponse(200, false, "TFT not available");
    return;
  }

  bool ok = performTFTStep(stepId);
  if (!ok) {
    sendOperationError(400, "Unknown TFT step");
    return;
  }

  String label = getTFTStepLabel(stepId);
  String message = "Step executed: " + label;
  sendOperationSuccess(message);
#else
  sendActionResponse(200, false, "TFT not enabled");
#endif
}

void handleTFTBoot() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    sendActionResponse(200, false, "TFT not available");
    return;
  }

  displayBootSplash();
  
  // Display WiFi info if connected
  if (WiFi.status() == WL_CONNECTED) {
    displayWiFiConnected(WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());
  } else {
    displayWiFiStatus("WiFi not connected", TFT_ORANGE);
  }
  
  sendOperationSuccess("Boot screen displayed");
#else
  sendActionResponse(200, false, "TFT not enabled");
#endif
}

void handleTFTConfig() {
#if ENABLE_TFT_DISPLAY
  // Check for required parameters
  if (server.hasArg("mosi") && server.hasArg("sclk") && server.hasArg("cs") && 
      server.hasArg("dc") && server.hasArg("rst")) {
    
    int newMOSI = server.arg("mosi").toInt();
    int newSCLK = server.arg("sclk").toInt();
    int newCS = server.arg("cs").toInt();
    int newDC = server.arg("dc").toInt();
    int newRST = server.arg("rst").toInt();
    
    // Optional parameters
    int newBL = server.hasArg("bl") ? server.arg("bl").toInt() : tftBL;
    int newWidth = server.hasArg("width") ? server.arg("width").toInt() : tftWidth;
    int newHeight = server.hasArg("height") ? server.arg("height").toInt() : tftHeight;
    int newRotation = server.hasArg("rotation") ? server.arg("rotation").toInt() : tftRotation;

    // Validate pin ranges
    if (newMOSI >= 0 && newMOSI <= 48 && newSCLK >= 0 && newSCLK <= 48 &&
        newCS >= 0 && newCS <= 48 && newDC >= 0 && newDC <= 48 && 
        newRST >= -1 && newRST <= 48 && newBL >= -1 && newBL <= 48 &&
        newRotation >= 0 && newRotation <= 3) {
      
      // Update configuration
      tftMOSI = newMOSI;
      tftSCLK = newSCLK;
      tftCS = newCS;
      tftDC = newDC;
      tftRST = newRST;
      tftBL = newBL;
      tftWidth = newWidth;
      tftHeight = newHeight;
      tftRotation = newRotation;

      // Reinitialize TFT with new settings
      tftAvailable = false;
      // Note: Complete reinitialization would require SPI reconfiguration
      // For now, we just store the values for next reboot
      
      String message = "TFT config updated: MOSI:" + String(tftMOSI) + " SCLK:" + String(tftSCLK) + 
                       " CS:" + String(tftCS) + " DC:" + String(tftDC) + " RST:" + String(tftRST) +
                       " Res:" + String(tftWidth) + "x" + String(tftHeight) + " Rot:" + String(tftRotation);
      
      sendOperationSuccess(message, {
        jsonNumberField("mosi", tftMOSI),
        jsonNumberField("sclk", tftSCLK),
        jsonNumberField("cs", tftCS),
        jsonNumberField("dc", tftDC),
        jsonNumberField("rst", tftRST),
        jsonNumberField("bl", tftBL),
        jsonNumberField("width", tftWidth),
        jsonNumberField("height", tftHeight),
        jsonNumberField("rotation", tftRotation)
      });
      return;
    }
  }
  sendOperationError(400, Texts::configuration_invalid.str());
#else
  sendActionResponse(200, false, "TFT not enabled");
#endif
}

void handleADCTest() {
  testADC();
  String json;
  json.reserve(adcReadings.size() * 60 + 50);  // Estimate size to avoid reallocations
  json = "{\"readings\":[";
  for (size_t i = 0; i < adcReadings.size(); i++) {
    if (i > 0) json += ",";
    json += "{\"pin\":" + String(adcReadings[i].pin) + ",\"raw\":" + String(adcReadings[i].rawValue) +
            ",\"voltage\":" + String(adcReadings[i].voltage, 2) + "}";
  }
  json += "],\"result\":\"" + adcTestResult + "\"}";
  server.send(200, "application/json", json);
}

void handlePWMTest() {
  testPWM();
  sendJsonResponse(200, { jsonStringField("result", pwmTestResult) });
}

void handleSPIScan() {
  scanSPI();
  sendJsonResponse(200, { jsonStringField("info", spiInfo) });
}

void handlePartitionsList() {
  listPartitions();
  sendJsonResponse(200, { jsonStringField("partitions", partitionsInfo) });
}

void handleStressTest() {
  memoryStressTest();
  sendJsonResponse(200, {
    jsonStringField("result", stressTestResult),
    jsonNumberField("allocations", static_cast<unsigned long>(stressAllocationCount)),
    jsonNumberField("durationMs", stressDurationMs),
    jsonStringField("allocationsLabel", stressTestResult)
  });
}

// Handlers API pour les nouveaux capteurs
void handleRGBLedConfig() {
  if (server.hasArg("r") && server.hasArg("g") && server.hasArg("b")) {
    RGB_LED_PIN_R = server.arg("r").toInt();
    RGB_LED_PIN_G = server.arg("g").toInt();
    RGB_LED_PIN_B = server.arg("b").toInt();
    sendActionResponse(200, true, String(Texts::ok));
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleRGBLedTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(rgbLedTestRunner, runRgbLedTestTask, alreadyRunning, 3072, 1);

  if (started) {
    sendJsonResponse(202, {
      jsonBoolField("running", true),
      jsonBoolField("success", rgbLedAvailable),
      jsonStringField("result", rgbLedTestResult)
    });
    return;
  }

  if (alreadyRunning) {
    sendJsonResponse(200, {
      jsonBoolField("running", true),
      jsonBoolField("success", rgbLedAvailable),
      jsonStringField("result", rgbLedTestResult)
    });
    return;
  }

  testRGBLed();
  sendJsonResponse(200, {
    jsonBoolField("running", false),
    jsonBoolField("success", rgbLedAvailable),
    jsonStringField("result", rgbLedTestResult)
  });
}

void handleRGBLedColor() {
  if (server.hasArg("r") && server.hasArg("g") && server.hasArg("b")) {
    int r = server.arg("r").toInt();
    int g = server.arg("g").toInt();
    int b = server.arg("b").toInt();
    setRGBLedColor(r, g, b);
    sendActionResponse(200, true, "RGB(" + String(r) + "," + String(g) + "," + String(b) + ")");
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleBuzzerConfig() {
  if (server.hasArg("pin")) {
    BUZZER_PIN = server.arg("pin").toInt();
    sendActionResponse(200, true, String(Texts::ok));
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleBuzzerTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(buzzerTestRunner, runBuzzerTestTask, alreadyRunning, 3072, 1);

  if (started) {
    sendJsonResponse(202, {
      jsonBoolField("running", true),
      jsonBoolField("success", buzzerAvailable),
      jsonStringField("result", buzzerTestResult)
    });
    return;
  }

