morfredus/ESP32-Diagnostic/src/main.cpp
  // Send translations
  String translations = "const DEFAULT_TRANSLATIONS=";
  translations += buildTranslationsJSON();
  translations += ";let translationsCache=DEFAULT_TRANSLATIONS;";

  Serial.printf("Sending translations: %d bytes\n", translations.length());
  server.sendContent(translations);

  // Send main JavaScript from PROGMEM without allocating a giant String
  // Stream in chunks to avoid heap exhaustion on ESP32 classic
  const char* staticJsPtr = DIAGNOSTIC_JS_STATIC;
  size_t staticJsLen = strlen_P(staticJsPtr);

  Serial.printf("Sending static JS (chunked): %d bytes\n", staticJsLen);
  const size_t CHUNK_SIZE = 1024;
  char chunkBuf[CHUNK_SIZE + 1];
  size_t sent = 0;
  while (sent < staticJsLen) {
    size_t n = (staticJsLen - sent) > CHUNK_SIZE ? CHUNK_SIZE : (staticJsLen - sent);
    memcpy_P(chunkBuf, staticJsPtr + sent, n);
    chunkBuf[n] = '\0';
    server.sendContent(chunkBuf);
    sent += n;
  }

  // Verify critical functions are present (direct pointer access works on ESP32)
  bool hasShowTab = (strstr(staticJsPtr, "function showTab") != NULL);
  bool hasChangeLang = (strstr(staticJsPtr, "function changeLang") != NULL);

  Serial.printf("Function showTab: %s\n", hasShowTab ? "YES" : "NO [ERROR]");
  Serial.printf("Function changeLang: %s\n", hasChangeLang ? "YES" : "NO [ERROR]");

  if (!hasShowTab || !hasChangeLang) {
    Serial.println("CRITICAL ERROR: JS functions missing in PROGMEM!");
    Serial.println("Check DIAGNOSTIC_JS_STATIC in web_interface.h");
  }

  // End chunked transfer
  server.sendContent("");

  unsigned long generateTime = millis() - startTime;
  Serial.printf("Total generation time: %lu ms\n", generateTime);
  Serial.printf("Free heap at end: %d bytes\n", ESP.getFreeHeap());
  Serial.println("======================================\n");
}

// Modern web interface with dynamic tabs
void handleRoot() {
  logClientConnection("Web Interface");
  server.send(200, "text/html; charset=utf-8", generateHTML());
}

// ========== DEBUG ROUTES (Troubleshooting) ==========
void setupDebugRoutes() {
  // Minimal test JavaScript
  server.on("/js/test.js", []() {
    String js = "console.log('Test JS loaded successfully');\n";
    js += "function showTab(n,b){console.log('showTab called:',n);alert('Test showTab: '+n);}\n";
    js += "function changeLang(l,b){console.log('changeLang called:',l);alert('Test changeLang: '+l);}\n";
    js += "console.log('Test functions defined');\n";
    server.send(200, "application/javascript; charset=utf-8", js);
  });

  // Debug status endpoint
  server.on("/debug/status", []() {
    String json = "{";
    json += "\"freeHeap\":" + String(ESP.getFreeHeap()) + ",";
    json += "\"jsSize\":" + String(generateJavaScript().length()) + ",";
    json += "\"version\":\"" + String(DIAGNOSTIC_VERSION_STR) + "\"";
    json += "}";
    server.send(200, "application/json", json);
  });

  Serial.println("[DEBUG] Debug routes installed: /js/test.js, /debug/status");
}

// ========== SETUP COMPLET ==========
void setup() {
  Serial.begin(115200);
  delay(1000);

  Serial.println("\r\n===============================================");
  Serial.println("     DIAGNOSTIC ESP32 MULTILINGUE");
  Serial.printf("     Version %s - FR/EN\r\n", DIAGNOSTIC_VERSION_STR);
  Serial.printf("     Arduino Core %s\r\n", getArduinoCoreVersionString().c_str());
  Serial.println("===============================================\r\n");

  printPSRAMDiagnostic();

  // Early OLED detection for WiFi status feedback
  detectOLED();

  // TFT Display initialization
  if (initTFT()) {
    displayBootSplash();
    delay(1000);
  }

  // WiFi
  WiFi.mode(WIFI_STA);
  WiFi.persistent(false);

  WiFi.setSleep(false);
  configureNetworkHostname();
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 0)
  WiFi.setScanMethod(WIFI_ALL_CHANNEL_SCAN);
#ifdef WIFI_CONNECT_AP_BY_SIGNAL
  WiFi.setSortMethod(WIFI_CONNECT_AP_BY_SIGNAL);
#endif
#endif
  wifiMulti.addAP(WIFI_SSID_1, WIFI_PASS_1);
  wifiMulti.addAP(WIFI_SSID_2, WIFI_PASS_2);

  Serial.println("Connexion WiFi...");
  const int maxWiFiAttempts = 40;
  int attempt = 0;
  if (oledAvailable) {
    oledShowWiFiStatus(String(Texts::wifi_connection),
                       String(Texts::loading),
                       "",
                       0);
  }
  displayWiFiStatus("Connecting to WiFi...");
  while (wifiMulti.run() != WL_CONNECTED && attempt < maxWiFiAttempts) {
    delay(500);
    Serial.print(".");
    attempt++;
    if (oledAvailable) {
      int progress = (attempt * 100) / maxWiFiAttempts;
      if (progress > 100) {
        progress = 100;
      }
      String detail = String(Texts::loading) + " " + String(progress) + "%";
      oledShowWiFiStatus(String(Texts::wifi_connection),
                         detail,
                         "",
                         progress);
    }
  }

  bool wifiConnected = (WiFi.status() == WL_CONNECTED);
#if DIAGNOSTIC_HAS_MDNS
  wifiPreviouslyConnected = wifiConnected;
#endif

  if (wifiConnected) {
    Serial.println("\r\n\r\nWiFi OK!");
    Serial.printf("SSID: %s\r\n", WiFi.SSID().c_str());
    Serial.printf("IP: %s\r\n\r\n", WiFi.localIP().toString().c_str());
    if (oledAvailable) {
      String detail = String(Texts::connected) + ": " + WiFi.SSID();
      String footer = WiFi.localIP().toString();
      oledShowWiFiStatus(String(Texts::wifi_connection), detail, footer, 100);
    }
    displayWiFiConnected(WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());
    if (startMDNSService(true)) {
      Serial.printf("[Accès] Lien constant : %s\r\n", getStableAccessURL().c_str());
    } else {
      Serial.println("[mDNS] Initialisation différée - nouvel essai automatique");
    }
  } else {
    Serial.println("\r\n\r\nPas de WiFi\r\n");
    Serial.printf("[Accès] Lien constant disponible après connexion : %s\r\n", getStableAccessURL().c_str());
    if (oledAvailable) {
      oledShowWiFiStatus(String(Texts::wifi_connection),
                         String(Texts::disconnected),
                         getStableAccessURL(),
                         -1);
    }
    displayWiFiFailed();
  }

  // Détections
  detectBuiltinLED();
  detectNeoPixelSupport();

  if (strip != nullptr) {
    strip->begin();
    strip->clear();
    strip->show();
  }
  
  if (ENABLE_I2C_SCAN) {
    scanI2C();
  }
  
  scanSPI();
  listPartitions();
  
  collectDiagnosticInfo();
  collectDetailedMemory();

